---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.FabricAreaType
source: html/132f328f-c6e9-685e-c7e0-a24eaae6c234.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.FabricAreaType Property

The type of the Fabric Area.

## Syntax (C#)
```csharp
public FabricAreaType FabricAreaType { get; }
```